PeprApp/app/controllers/users_controller.rb

    def create
        user = User.create!(user_params)
---
INSERT INTO "users" ("username", "password_digest", "auth_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"